Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་ཅིང་མངོན་པར་སྒྲུབ་བོ། །ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་ཅིང་མངོན་པར་སྒྲུབ་བོ། །འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་ཅིང་མངོན་པར་སྒྲུབ་བོ། །
en: Gradually, they should then rest in and accomplish the attainments of the field of limitless consciousness, the field of nothing whatsoever, and the field of neither perception nor non-perception.

source: དེ་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་པོ་འདི་དག་གིས་གནས་ལ། དེ་དག་གི་རོ་ཡང་མྱོང་བར་མི་བྱེད་དོ།
en: However, even though they use these attainments of the formless realm as a basis, they should not savor these experiences.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དོན་གྱི་དབང་གང་ཡང་དག་པར་མཐོང་བས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་པར་མི་བགྱིད།
en: Venerable Śāradvatīputra then said to the Blessed One, “Blessed One, when bodhisattva great beings perceive the significance of this, they will not rest evenly in the attainment of the state of cessation.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྷུང་དུ་དོགས་པའི་ཕྱིར་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པའི་བདེ་བ་ལ་མཉམ་པར་མི་གཞོག་སྟེ། འདུ་ཤེས་དང་། ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞག་ན་ནི། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་བར་ཤེས་པར་བྱ་སྟེ།
en: The Blessed One said, “Śāradvatīputra, because bodhisattva great beings are afraid to fall into the levels of the hearers and the solitary buddhas, they should not rest in the blissful attainment of the cessation of perceptions and feelings. They should recognize that if they come to rest in the blissful attainment of the cessation of perceptions and feelings, they will actualize the result of a worthy one.

source: ཤ་ར་དྭ་ཏིའི་བུ་དོན་གྱི་དབང་འདི་ཡང་དག་པར་མཐོང་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་མི་གཞོག་གོ། །
en: Śāradvatīputra, if bodhisattva great beings see these implications, they will avoid resting in the attainment of the cessation of perceptions and feelings.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདི་ལྟར་སྙོམས་པར་འཇུག་པ་འདི་དག་ཉིད་ཀྱིས་གནས་ལ། སྙོམས་པར་འཇུག་པའི་རོ་ཡང་མྱོང་བར་མི་བགྱིད་ཅིང་། སྙོམས་པར་འཇུག་པ་འདི་དག་ལ་འདོད་ཆགས་དང་ཡང་མ་བྲལ་བ་ནི་ངོ་མཚར་བགྱིད་པ་ལགས་སོ།
en: Śāradvatīputra said, “Blessed One, it is amazing how bodhisattva great beings use these states of attainment as a foundation, yet do not savor the experience of attainment, nor have any attachment to these states.”

source: །བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One said, “Śāradvatīputra, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འདི་ལྟར་སྙོམས་པར་འཇུག་པ་འདི་དག་ཉིད་ཀྱིས་གནས་ལ། སྙོམས་པར་འཇུག་པ་འདི་དག་གི་རོ་ཡང་མྱོང་བར་མི་བྱེད་ཅིང་། སྙོམས་པར་འཇུག་པ་འདི་དག་ལ་འདོད་ཆགས་དང་ཡང་མ་བྲལ་བ་ནི་ངོ་མཚར་བྱེད་པ་ཡིན་ཏེ།
en: It is amazing how bodhisattvas use these states of attainment as a foundation without savoring the experience of attainment and without developing any attachment to these states.

source: ཤིན་ཏུ་ངོ་མཚར་ཏོ།
en: It is truly amazing.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བས་ན་དོན་འདི་ཡང་རྒྱས་པར་བྱ་བ་དང་། རྫོགས་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་དཔེ་བསྟན་པར་བྱའོ།
en: Śāradvatīputra, therefore, I shall give you an analogy in order to elaborate on and clarify this point.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། འཛམ་བུའི་གླིང་གི་མི་འདོད་ཆགས་དང་མ་བྲལ། འདུན་པ་དང་མ་བྲལ་བ། བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དུ་སོང་སྟེ།
en: Śāradvatīputra, for this analogy, imagine if a person from this Jambu continent, who is not free of desire and craving, were to travel to the Unpleasant Sound continent to the north.

source: དེ་བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དུ་སོང་ནས། བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་བདག་གི་བ་མེད་ཅིང་ཡོངས་སུ་མ་བཟུང་བའི་བུད་མེད་རྣམས་དང་། དཔག་བསམ་གྱི་ཤིང་ལས་བྱུང་བའི་གོས་རྣམས་དང་། མ་རྨོས་མ་བཏབ་པའི་འབྲས་རྣམས་དང་། རྒྱན་དང་ལྡན་པའི་ཤིང་དེ་དག་དང་། ཉེ་བར་སྤྱད་པ་དང་། ལོངས་སྤྱད་པ་དེ་དག་དང་། ཡོངས་སུ་མ་བཟུང་བའི་གསེར་དང་། རིན་པོ་ཆེ་དེ་དག་མཐོང་སྟེ།
en: Upon arrival there, he would witness all the available riches of the northern continent, such as the unclaimed women, the fabrics that emerge from the wish-fulfilling tree, the fruits that appear without being cultivated, the ornamented trees, along with all the other pleasures and enjoyments and all the unclaimed gold and gems.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་མི་དེས་བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དེའི་ཁོ་ར་ཁོར་ཡུག་མཐོང་ནས། ཕྱིར་འཁོར་ཏེ་འོངས་ན། དེ་ལ་ཆགས་པའམ་འཆིང་བ་ཡང་མེད་དོ།
en: Śāradvatīputra, although he would see the full extent of the scenery of the Unpleasant Sound continent, since he had to return, he would feel no attachment or craving.

source: །དེ་ནས་མི་དེ་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་ཉེ་བར་སྤྱད་པ་དང་། ལོངས་སྤྱད་པ་ཀུན་མཐོང་ནས། ཕྱིར་འཛམ་བུའི་གླིང་དུ་འོང་བ་དེ་བཞིན་དུ།
en: Even though he had seen all the pleasures and enjoyments of those living in the Unpleasant Sound continent, he would nevertheless return here to the Jambu continent.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་བཞི་པོ་འདི་དག་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་རྣམས་ཀྱིས་གནས་ཀྱང་། དེ་དག་གི་རོ་ཡང་མྱོང་བར་མི་བྱེད་དོ།
en: Śāradvatīputra, likewise, even though bodhisattva great beings practice the four concentrations as well as the four attainments of the formless realm, they do not savor the experience of them.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བསམ་གཏན་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་རྣམས་ལ་གནས་པ་དེ་དག་གིས་འདྲིས་པར་བྱས་ནས། ཡང་དེ་འདོད་པ་ན་སྤྱོད་པའི་ཆོས་རྣམས་ལ་དམིགས་ཏེ།
en: When bodhisattva great beings cultivate the four concentrations and the four attainments of the formless realm as foundations, they focus on the world of those who experience desire.

source: དེའི་ལུས་ཞིག་པ་ན་ཕྱིར་ཡང་འདོད་པའི་ཁམས་སུ་ལུས་མངོན་པར་འགྲུབ་བོ།
en: In doing so, they will once again manifest a physical body in the realm of desire when their current body disintegrates.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡང་དག་པར་བླངས་ཏེ་གནས་སོ། །
en: Śāradvatīputra, this is how bodhisattvas adopt and practice the six perfections.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་ཁྱད་པར་ཅན་དང་། ས་ཁྱད་པར་ཅན་བོར་ཏེ། སླར་ཡང་འདོད་པའི་ཁམས་སུ་སྐྱེ་བར་གནང་བར་མཛད།
en: Venerable Śāradvatīputra asked the Blessed One, “Honorable Blessed One, why do the bodhisattva great beings abandon such special abodes and such unique levels, only to take birth in the desire realm once again?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷ་ཚེ་རིང་པོའི་ནང་དུ་སྐྱེ་བར་མ་གནང་ངོ་།
en: The Blessed One said, “Śāradvatīputra, bodhisattva great beings do not take birth among the long-lived gods.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱོགས་རིང་བར་བྱེད་དུ་འོང་བ་དང་། ཡུན་རིང་མོ་ཞིག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་དུ་དོགས་པའི་ཕྱིར་རོ། །
en: Because they fear that it will delay their practice of the perfections and postpone their full awakening to unsurpassed and perfect buddhahood.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་གནས་གྱ་ནོམ་པ་བོར་ཏེ། སླར་ཡང་ས་ཐ་ཆད་ལ་དམིགས་པ་ནི་དཀའ་བ་བགྱིད་པ་ལགས་སོ།
en: Śāradvatīputra said, “Blessed One, it must be very difficult for bodhisattvas to abandon such a sublime place and instead turn their attention to this awful place.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དཔེར་བགྱི་ན། མི་འདོད་ཆགས་དང་མ་བྲལ་བ། འདུན་པ་དང་མ་བྲལ་བ་ལ་ལ་ཞིག་གིས་བུད་མེད་རིན་པོ་ཆེ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཅེས་པར་མཆིས་པ་ཞིག་མཐོང་ན། དེས་དེ་ཀུན་དུ་བརྟགས་ཏེ། ཡན་ལག་དང་ཉིང་ལག་གི་མཚན་མ་ཐམས་ཅད་ཀྱང་བཟུང་མོད་ཀྱི་དེ་ལ་བག་མ་མཆིས་པ་ཡང་མི་བགྱིད་དོ།
en: Honorable Blessed One, as an analogy, when a person who is not free of desire and craving sees a fine woman, beautifully adorned with all sorts of jewelry, he will surely observe her and scan her entire appearance, but he would nevertheless not act lasciviously toward her.

source: །དེ་དུས་གཞན་ཞིག་ན་བུད་མེད་ངན་པ་བྲན་མོའམ། ལས་བགྱིད་པ་འགའ་ཞིག་ཕྱོགས་སྟོང་པར་མཐོང་ནས།
en: At another time, he might come across a repulsive female servant or laborer in a deserted area.

source: དེ་ལ་ལྟ་སྟེ། ཤིན་ཏུ་བལྟ་ན་སྡུག་པ་ཡང་མ་ལགས། ཤིན་ཏུ་གཟུགས་བཟང་བ་ཡང་མ་ལགས་མོད་ཀྱི། དེ་དེ་ལ་བག་མ་མཆིས་པར་བགྱིད་དོ།
en: Looking at her he will of course not find her very beautiful or attractive and yet he might act lasciviously toward her.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་བསམ་གཏན་བཞི་དང་། གཟུགས་མ་མཆིས་པའི་སྙོམས་པར་འཇུག་པ་བཞི་རྣམས་ལ། ཅི་བདེ་ཅི་དགར་གནས་ནས། གནས་དེ་དག་བོར་ཏེ། སླར་ཡང་འདོད་པའི་ཁམས་ལ་ལྷག་པར་དམིགས་པ་རྣམས་དཔེ་དེ་དང་འདྲ་བ་སྙམ་བགྱིད་དོ།
en: Blessed One, I think this is a suitable analogy to illustrate how bodhisattva great beings abandon the blissful and joyful abodes of the four concentrations and the four attainments of the formless realm and once again turn their attention to the desire realm.”

source: །བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གནས་པ་འདི་དག་གིས་གནས་པ་ཕྱིར་ཡང་འདོད་པའི་ཁམས་ལ་དམིགས་པ་འདི་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: The Blessed One said, “Śāradvatīputra, when bodhisattva great beings turn their attention from these abodes and focus on the desire realm instead, that, Śāradvatīputra, is the skillful means of the bodhisattvas.

source: འདི་ལྟར་དེས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་མ་སྤངས་པའི་ཕྱིར་རོ།
en: Because this is how they avoid abandoning omniscience.”

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་དང་པོའོ།། །།
en: This is the first chapter from “The Perfection of Concentration.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་གཞག་པར་གནང་བར་མཛད་ཅིང་། བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ལས་བརྩམས་ཏེ། མཉམ་པར་གཞག་པར་གནང་བ་མཛད་ལ། དེ་ལ་གནས་པར་ནི་གནང་བར་མ་མཛད། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Venerable Pūrṇa Maitrāyaṇīputra asked Venerable Śāradvatīputra, “Venerable Śāradvatīputra, why are bodhisattva great beings permitted to practice the attainment of the first concentration state and why are they likewise permitted to undertake the second, third, and fourth concentrations, and yet not dwell in them?”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་ལུས་ཞིག་ནས་ལྷ་ཚེ་རིང་པོའི་ནང་དུ་སྐྱེ་བར་འགྱུར་དུ་དོགས་པའི་ཕྱིར་ཏེ།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, because they fear taking birth among the long-lived gods once their body disintegrates.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་འདི་ཡང་དག་པར་གཟིགས་ནས་ལྷ་ཚེ་རིང་པོའི་ནང་དུ་སྐྱེ་བར་མ་གནང་ངོ་།
en: Venerable Pūrṇa, since the thus-gone, worthy, perfect Buddha perceives these consequences, he does not allow them to take birth among the long-lived gods.

source: འདོད་པའི་ཁམས་སུ་སྐྱེས་ན། ཆེས་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because if they are born in the desire realm they can more swiftly perfect the state of omniscience.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ཙམ་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་གནས་པ་དེ་དག་གིས་གནས་ནས། ཕྱིར་ཡང་གནས་པ་དེ་དག་བོར་ཏེ་འོག་མའི་ཆོས་འདི་ལ་དམིགས་པ་ནི་དཀའ་བ་བྱེད་པ་སྟེ་ངོ་མཚར་ཏོ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, it is amazing how bodhisattva great beings practice these concentration levels, only to later abandon these levels and turn their attention to this lowly world so filled with hardships.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། མི་ལ་ལ་ཞིག་གིས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཏེར་མཐོང་ནས། བགྲངས་ཏེ་བསྣམས་ནས་སོང་ལ།
en: Venerable Śāradvatīputra, as an analogy, if a man finds a treasure filled with many different jewels, he will evaluate it, pick it up, and then proceed.

source: དུས་གཞན་ཞིག་དུ་ཀ་ཀ་ནིའམ། ཀཱར་ཥཱ་པ་ཎ་མཐོང་ན། དེ་ལ་ལག་པས་བསྙབས་ཏེ། བླངས་ནས་འགྲོ་བ་དེ་བཞིན་དུ།
en: Another time, he may see a kākaṇi coin or a kārṣāpaṇa coin and, stretching out his arm, pick it up and proceed.

source: ཚེ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་པོ་འདི་དག་ལ་ཅི་བདེ་ཅི་དགར་གནས་ནས་བགྲངས་ཏེ་གཅལ་ལ་མཉམ་པར་བཞག་ནས།
en: Likewise, Venerable One, once bodhisattva great beings have rested blissfully and leisurely in the four concentrations and the four attainments of the formless realm, they will at first evaluate them and then rest within those states.

source: ཕྱིར་ཡང་འདོད་པ་དང་ལྡན་པའི་ཆོས་རྣམས་ལ་དམིགས་ཤིང་། དེའི་ལུས་ཞིག་ནས་ཕྱིར་ཡང་འདོད་པའི་ཁམས་སུ་སྐྱེ་སྟེ།
en: However, they will subsequently turn their attention to the phenomena of the desire realm and, as their body disintegrates, they will take birth in the desire realm.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡང་དག་པར་བླངས་ནས་གནས་པར་འགྱུར་ཏེ།
en: In this way the bodhisattva great beings will once again take up the practice of the six perfections.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་འདི་ཡང་དག་པར་གཟིགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷ་ཚེ་རིང་པོའི་ནང་དུ་སྐྱེ་བར་གནང་བར་མི་མཛད་དོ།
en: Venerable Śāradvatīputra, since the thus-gone, worthy, perfect Buddha perceives the implications of all this, he does not allow bodhisattvas to take birth among the long-lived gods.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་འདི་སྐད་དུ་སྟོན་ཅིང་འཆད་པ། དེ་བཞིན་གཤེགས་པས་གསུངས་པ་སྨྲ་བ་དང་། ཆོས་སྨྲ་བ་ལགས་སམ། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལུང་སྟོན་པ་ལགས་སམ།
en: Venerable Pūrṇa Maitrāyaṇīputra asked the Blessed One, “Blessed One, that which I have taught and explained here, is that taught by the Thus-Gone One and is it a Dharma statement? Is it a Dharma discourse that agrees with the Dharma?”

source: བཀའ་སྩལ་པ། གང་པོ་ཁྱོད་དེ་སྐད་སྟོན་ཅིང་དེ་སྐད་འཆད་ན། ཁྱོད་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་སྨྲ་བ་ཡིན།
en: The Blessed One said, “Pūrṇa, what you have taught and explained is taught by the Thus-Gone One.

source: ཆོས་སྨྲ་བ་ཡིན།
en: It is a Dharma statement.

source: ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལུང་སྟོན་པ་ཡིན་ནོ།
en: It is a Dharma discourse that agrees with the Dharma.

source: །གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གལ་ཏེ་བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་གཞོག་ཅིང་། བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ལ་མཉམ་པར་གཞོག་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ། བསམ་གཏན་འདི་དག་བསྐྱེད་དེ། གཟུགས་ཀྱི་ཁམས་སམ། གཟུགས་མེད་པའི་ཁམས་སུ་སྐྱེ་བར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ།
en: Pūrṇa, if bodhisattva great beings rest in the first concentration, as well as the second, third, and fourth concentrations, they must not think, ‘I have produced these concentrations and now I will take birth in the form realm or the formless realm.’

source: །གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ལས་འདའ་བར་བྱའོ་སྙམ་དུ་ཡང་མི་སེམས་སོ།
en: However, neither should they think, ‘I will go beyond the form realm and the formless realm.’ ”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་དེ་བཞིན་གཤེགས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མ་མཆིས་པའི་ཁམས་ལས་འདས་ཏེ། ཁོངས་སུ་མ་གཏོགས་པ་ཞིག་ལགས་སམ།
en: Pūrṇa asked, “Honorable Blessed One, is the omniscience of the Thus-Gone One beyond, and separate from, the desire realm, the form realm, and the formless realm?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One said, “Pūrṇa, that is correct.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་འདོད་པའི་ཁམས་ལས་འདས། གཟུགས་ཀྱི་ཁམས་ལས་འདས། གཟུགས་མེད་པའི་ཁམས་ལས་འདས་ཤིང་།
en: The omniscience of the thus-gone, worthy, perfect Buddha is beyond the desire realm, beyond the form realm, and beyond the formless realm.

source: ཁམས་གསུམ་ལས་འདས་ཏེ་ཁོངས་སུ་མ་གཏོགས་པ་ཡིན་ནོ། །
en: It is beyond, and separate from, these three realms.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཁམས་གསུམ་གྱི་ཁོངས་སུ་མ་གཏོགས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་གང་ཡང་དག་པར་གཟིགས་ན། བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་ཞིང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ལ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མ་མཆིས་པའི་ཁམས་ལས་ཡང་དག་པར་འདའ་བར་གནང་བར་མི་མཛད།
en: Pūrṇa said, “Blessed One, if the omniscience of the Thus-Gone One is separate from the three realms, then, as the thus-gone, worthy, perfect Buddha sees the implications of doing so, he should not allow the bodhisattvas to awaken to unsurpassed and perfect buddhahood and, practicing the perfection of concentration, transcend the desire realm, the form realm, and the formless realm.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ཅིང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ལ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ལས་ཡང་དག་པར་འདའ་བར་གནང་དུ་ཟིན་ན། བྱང་ཆུབ་སེམས་དཔའི་དམ་བཅས་པ་སྤོང་བར་འགྱུར་ཏེ། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་འགྱུར་རོ། །
en: The Blessed One said, “Pūrṇa, if bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood and practice the perfection of concentration were allowed to transcend the desire realm, the form realm, and the formless realm, they would abandon their bodhisattva vow and end up on the levels of the hearers and the solitary buddhas.

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གི་ཚེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་ན། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་སྤོང་བའི་དུས་དེ་དང་སྐབས་དེ་ཡོད་དོ། །
en: Pūrṇa, when bodhisattva great beings sit at the seat of awakening, that is the time and occasion for the bodhisattva great beings to abandon the desire realm and the form realm.

source: གང་པོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་སྐྱེ་བ་སྐྱེས་ཤིང་། འབྱུང་ངོ་ཅོག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཁམས་གསུམ་པ་རིང་བར་བྱེད་ཅིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: Pūrṇa, it is when bodhisattvas have aroused the mind of awakening and dedicated all that arises toward omniscience that they remove themselves from the third realm and bring themselves closer to omniscience.”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ན་དེ་བསམ་གཏན་དེ་དག་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་གི་རོ་ཡང་མྱང་བར་མི་བགྱིད་ལ། འབྲལ་བར་ཡང་མི་བགྱིད་པ་ལགས།
en: Pūrṇa asked, “Honorable Blessed One, how do bodhisattvas who are practicing the perfection of concentration and who uphold the perfection of insight avoid savoring the experience of concentration and its subcategories without being apart from them either?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་བསམ་གཏན་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་ལ་བདག་མེད་པའི་འདུ་ཤེས་ཀྱིས་ཉེ་བར་གནས་པ་ཡིན་ཏེ།
en: The Blessed One said, “Pūrṇa, when bodhisattvas practice the perfection of concentration, they maintain the concentrations and their subcategories while applying the notion of egolessness.

source: དེ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་དོ།
en: They then dedicate the resulting roots of virtue toward the state of omniscience.

source: །གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ཏེ། བསམ་གཏན་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་གི་རོ་ཡང་མྱོང་བར་མི་བྱེད་ལ། འབྲལ་བར་ཡང་མི་བྱེད་དོ།
en: Pūrṇa, in this way bodhisattva great beings practice the perfection of concentration and uphold the perfection of insight without savoring the experience of concentration or its subcategories, and yet without being apart from them either.”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Pūrṇa asked, “Honorable Blessed One, how do bodhisattvas practice the perfection of concentration and uphold the perfection of diligence?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། འདོད་པའི་ཁམས་ལས་འདས་ནས། བསམ་གཏན་དེ་དག་ཀྱང་སྤངས་ལ། ཕྱིར་ཡང་འདོད་པའི་ཁམས་ལ་དམིགས་པ་སྟེ།
en: The Blessed One said, “Pūrṇa, when bodhisattvas are practicing the perfection of concentration and have transcended the desire realm, they must abandon the concentrations and once again turn their attention to the desire realm.

source: གང་པོ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ།
en: Pūrṇa, then those bodhisattva great beings are practicing the perfection of concentration and upholding the perfection of diligence.”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Pūrṇa asked, “Honorable Blessed One, how do bodhisattvas practice the perfection of concentration and uphold the perfection of patience?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་ཞིང་། དེ་བསམ་གཏན་དེ་ཉིད་ལ་གནས་པ་ན་སེམས་གནོད་སེམས་མེད་པར་གནས་སོ།
en: The Blessed One said, “Pūrṇa, when bodhisattva great beings are filled with love and compassion and practice that very same concentration, they will rest without any hostility.

source: །གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ།
en: Pūrṇa, then those bodhisattva great beings are practicing the perfection of concentration and upholding the perfection of patience.”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Pūrṇa asked, “Honorable Blessed One, how do bodhisattvas practice the perfection of concentration and uphold the perfection of discipline?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་དག་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ན། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་མཆོག་ཏུ་འཛིན་པར་མི་བྱེད་དེ།
en: The Blessed One said, “Pūrṇa, when bodhisattvas practice the perfection of concentration, they should avoid thinking of the levels of the hearers and the solitary buddhas as being supreme.

source: གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ།
en: Pūrṇa, then those bodhisattva great beings are practicing the perfection of concentration and upholding the perfection of diligence.”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Pūrṇa asked, “Honorable Blessed One, how do bodhisattvas practice the perfection of concentration and uphold the perfection of generosity?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ན། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་སྐྱེད་དེ། སེམས་ཅན་འདི་དག་ནི་འཁོར་བ་ན་སྤྱོད་པའི་སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་མ་གྲོལ་གྱིས།
en: The Blessed One said, “Pūrṇa, when bodhisattvas practice the perfection of concentration, they should engender compassion for all beings and think, ‘These beings are never free from the sufferings experienced in saṃsāra.

source: བདག་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་འདི་དག་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཕན་གདགས་ཤིང་། ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་ཆོས་ཀྱང་བཤད་དོ་སྙམ་སྟེ།
en: Therefore, when I awaken to unsurpassed and perfect buddhahood, I will benefit these beings with the gift of the Dharma and teach them the Dharma, so that they can abandon all afflictions.’
